{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "cavity_detection",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ]
} 